Reports/ПлатежиИВзносыВПенсионныйФонд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Report>
		<Properties>
			<Name>ПлатежиИВзносыВПенсионныйФонд</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыводитьВОтдельномОкне</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Enums/ВидыНачисленийНеоблагаемыхЕСП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыНачисленийНеоблагаемыхЕСП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>н0201</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>н0202</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>н0203</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>н0204</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>н030</Name>
					<Comment>Прочее</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>н0205</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыНачисленийНеоблагаемыхВзносамиВПФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыНачисленийНеоблагаемыхВзносамиВПФ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>н0201</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>н0202</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>н0203</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>н0204</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>н030</Name>
					<Comment>Прочее</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РасчетБазовогоРазмераЕСП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>РасчетБазовогоРазмераЕСП</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьПоБУ</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоРаботников</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтработанныеДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочиеДниЗаМесяц</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормативЕСП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовыйРазмерЕСП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойГрафикРаботыОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НачисленныйЕСП</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетЗатрат</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КДоначислению</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Информация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГрафикРаботы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоРаботников</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДниНорма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДниФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормативЕСП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазовыйРазмерЕСП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидГрафикаДляРасчетаМинРазмераЕСП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/ПлатежиИВзносыВПенсионныйФонд/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПолучитьДанныеДляЕСП(Организация, НачалоПериода, КонецПериода) Экспорт
	
	Запрос = Новый Запрос ; 	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасчетБазовогоРазмераЕСПНачисленныйЕСП.Ссылка.КоличествоРаботников,
	|	РасчетБазовогоРазмераЕСПНачисленныйЕСП.Ссылка.ОтработанныеДни,
	|	РасчетБазовогоРазмераЕСПНачисленныйЕСП.Ссылка.РабочиеДниЗаМесяц,
	|	РасчетБазовогоРазмераЕСПНачисленныйЕСП.Ссылка.НормативЕСП,
	|	РасчетБазовогоРазмераЕСПНачисленныйЕСП.Ссылка.БазовыйРазмерЕСП,
	|	СУММА(РасчетБазовогоРазмераЕСПНачисленныйЕСП.Начислено) КАК ЕСПНачислено,
	|	СУММА(РасчетБазовогоРазмераЕСПНачисленныйЕСП.КДоначислению) КАК ЕСПкДоначислению
	|ПОМЕСТИТЬ ВТ_ДанныеРасчетаЕСП
	|ИЗ
	|	Документ.РасчетБазовогоРазмераЕСП.НачисленныйЕСП КАК РасчетБазовогоРазмераЕСПНачисленныйЕСП
	|ГДЕ
	|	РасчетБазовогоРазмераЕСПНачисленныйЕСП.Ссылка.Проведен
	|	И РасчетБазовогоРазмераЕСПНачисленныйЕСП.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РасчетБазовогоРазмераЕСПНачисленныйЕСП.Ссылка.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетБазовогоРазмераЕСПНачисленныйЕСП.Ссылка.КоличествоРаботников,
	|	РасчетБазовогоРазмераЕСПНачисленныйЕСП.Ссылка.ОтработанныеДни,
	|	РасчетБазовогоРазмераЕСПНачисленныйЕСП.Ссылка.РабочиеДниЗаМесяц,
	|	РасчетБазовогоРазмераЕСПНачисленныйЕСП.Ссылка.НормативЕСП,
	|	РасчетБазовогоРазмераЕСПНачисленныйЕСП.Ссылка.БазовыйРазмерЕСП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДоначислениеЕСП.КоличествоРаботников,
	|	ВТ_ДоначислениеЕСП.ОтработанныеДни,
	|	ВТ_ДоначислениеЕСП.РабочиеДниЗаМесяц,
	|	ВТ_ДоначислениеЕСП.НормативЕСП,
	|	ВТ_ДоначислениеЕСП.БазовыйРазмерЕСП,
	|	ВТ_ДоначислениеЕСП.ЕСПНачислено,
	|	ВТ_ДоначислениеЕСП.ЕСПкДоначислению КАК ЕСПкДоначислению
	|ИЗ
	|	ВТ_ДанныеРасчетаЕСП КАК ВТ_ДоначислениеЕСП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ДанныеРасчетаЕСП";
	
	Запрос.УстановитьПараметр("Организация"  , Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода" , КонецПериода);
	 	
	Результат = Запрос.Выполнить().Выбрать();
	Если  Результат.Следующий() Тогда
		Возврат Результат;
	КонецЕсли; 		

КонецФункции // ПолучитьДанныеДляЕСП()
    
Функция ПолучитьДоначисленныеЕСПЗаПериод(Организация, НачалоПериода, КонецПериода) Экспорт
	
	Запрос = Новый Запрос ; 	
	Запрос.Текст = "ВЫБРАТЬ
	|	РасчетБазовогоРазмераЕСПНачисленныйЕСП.Ссылка.КоличествоРаботников,
	|	РасчетБазовогоРазмераЕСПНачисленныйЕСП.Ссылка.ОтработанныеДни,
	|	РасчетБазовогоРазмераЕСПНачисленныйЕСП.Ссылка.РабочиеДниЗаМесяц,
	|	РасчетБазовогоРазмераЕСПНачисленныйЕСП.Ссылка.НормативЕСП,
	|	РасчетБазовогоРазмераЕСПНачисленныйЕСП.Ссылка.БазовыйРазмерЕСП,
	|	СУММА(РасчетБазовогоРазмераЕСПНачисленныйЕСП.Начислено) КАК ЕСПНачислено,
	|	СУММА(РасчетБазовогоРазмераЕСПНачисленныйЕСП.КДоначислению) КАК ЕСПкДоначислению
	|ПОМЕСТИТЬ ВТ_ДанныеРасчетаЕСП
	|ИЗ
	|	Документ.РасчетБазовогоРазмераЕСП.НачисленныйЕСП КАК РасчетБазовогоРазмераЕСПНачисленныйЕСП
	|ГДЕ
	|	РасчетБазовогоРазмераЕСПНачисленныйЕСП.Ссылка.Проведен
	|	И РасчетБазовогоРазмераЕСПНачисленныйЕСП.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РасчетБазовогоРазмераЕСПНачисленныйЕСП.Ссылка.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетБазовогоРазмераЕСПНачисленныйЕСП.Ссылка.КоличествоРаботников,
	|	РасчетБазовогоРазмераЕСПНачисленныйЕСП.Ссылка.ОтработанныеДни,
	|	РасчетБазовогоРазмераЕСПНачисленныйЕСП.Ссылка.РабочиеДниЗаМесяц,
	|	РасчетБазовогоРазмераЕСПНачисленныйЕСП.Ссылка.НормативЕСП,
	|	РасчетБазовогоРазмераЕСПНачисленныйЕСП.Ссылка.БазовыйРазмерЕСП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_ДоначислениеЕСП.ЕСПНачислено) КАК ЕСПНачислено,
	|	СУММА(ВТ_ДоначислениеЕСП.ЕСПкДоначислению) КАК ЕСПкДоначислению
	|ИЗ
	|	ВТ_ДанныеРасчетаЕСП КАК ВТ_ДоначислениеЕСП";
	
	Запрос.УстановитьПараметр("Организация"  , Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода" , КонецПериода);
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат;
	КонецЕсли; 				

КонецФункции // ПолучитьДоначисленныеЕСПЗаПериод()
 
Функция Приложение1_Получить(ПолучитьСтроку = Ложь, Стр = "") Экспорт
	
	а010 = 0;	а020 = 0;	а030 = 0;
	а040 = 0;	а050 = 0;	а060 = 0;
	а070 = 0;	а080 = 0;	а090 = 0;
	
	НачалоТекМесяца   = НачалоМесяца(КонецПериода);
	КонецТекМесяца    = КонецПериода;
	КонецПредМесяца   = НачалоТекМесяца - 1;
	НачалоПредМесяца  = НачалоМесяца(КонецПредМесяца);
	
	Рез = ПолучитьДанныеДляЕСП(Организация, НачалоТекМесяца, КонецТекМесяца);
	Если Рез <> Неопределено Тогда
		а010 = Рез.КоличествоРаботников;
		а020 = Рез.ОтработанныеДни;
		а030 = Рез.РабочиеДниЗаМесяц;
		а040 = Рез.НормативЕСП;
		а050 = Рез.БазовыйРазмерЕСП;
		а060 = Рез.ЕСПНачислено;
		а070 = Рез.ЕСПкДоначислению;
	КонецЕсли;
	
	Если НачалоПредМесяца  >=  НачалоПериода Тогда
		РезПредНаКонец = ПолучитьДоначисленныеЕСПЗаПериод(Организация, НачалоПредМесяца, КонецПредМесяца);
		Если РезПредНаКонец <> Неопределено Тогда
			а080 = РезПредНаКонец.ЕСПкДоначислению;
		КонецЕсли;
	КонецЕсли;
	
	а090 = а070 + а080;
	
	Строки = Новый Структура;
	Строки.Вставить("а010", а010);
	Строки.Вставить("а020", а020);
	Строки.Вставить("а030", а030);
	Строки.Вставить("а040", а040);
	Строки.Вставить("а050", а050);
	Строки.Вставить("а060", а060);
	Строки.Вставить("а070", а070);
	Строки.Вставить("а080", а080);
	Строки.Вставить("а090", а090);
	
	Если ПолучитьСтроку Тогда
		Возврат Строки[Стр];	
	Иначе
		Возврат Строки;
	КонецЕсли;         	
	
КонецФункции // Приложение1_Получить()

Функция Приложение2_Получить(ПолучитьСтроку = Ложь, Стр = "") Экспорт
	
	а010  = 0; 	а0101 = 0;	а0102 = 0;	а0103 = 0;
	а020  = 0;  а0201 = 0;	а0202 = 0;	а0203 = 0;
	а030  = 0;  а0301 = 0;	а0302 = 0;	а0303 = 0;
	а040  = 0;  а0401 = 0;	а0402 = 0;	а0403 = 0;
	а050  = 0;  а0501 = 0;	а0502 = 0;	а0503 = 0;
	а060  = 0;  а0601 = 0;	а0602 = 0;	а0603 = 0;
	а070  = 0;  а0701 = 0;	а0702 = 0;	а0703 = 0;
	а080  = 0;
	а090  = 0;  а0901 = 0;	а0902 = 0;	а0903 = 0;
	
	НачалоМесяца1 = НачалоКвартала(КонецПериода);
	КонецМесяца1  = КонецМесяца(НачалоМесяца1);
	НачалоМесяца2 = ДобавитьМесяц(НачалоМесяца1, 1);
	КонецМесяца2  = КонецМесяца(НачалоМесяца2);
	НачалоМесяца3 = ДобавитьМесяц(НачалоМесяца2, 1);
	КонецМесяца3  = КонецМесяца(НачалоМесяца3); 		
	КонецПредПериода  = НачалоМесяца1 - 1;
	НачалоПредПериода = НачалоКвартала(КонецПредПериода);
	
	Рез1М = ПолучитьДанныеДляЕСП(Организация, НачалоМесяца1, КонецМесяца1);
	Рез2М = ПолучитьДанныеДляЕСП(Организация, НачалоМесяца2, КонецМесяца2);
	Рез3М = ПолучитьДанныеДляЕСП(Организация, НачалоМесяца3, КонецМесяца3);
	
	Если НачалоПредПериода  >=  НачалоПериода Тогда
		РезПредНаКонец = ПолучитьДоначисленныеЕСПЗаПериод(Организация, НачалоПредПериода, КонецПредПериода);
		Если РезПредНаКонец <> Неопределено Тогда
			а080 = ?(РезПредНаКонец.ЕСПкДоначислению = Null, 0, РезПредНаКонец.ЕСПкДоначислению);
		КонецЕсли;
	КонецЕсли;
	
	Если КонецПериода >= КонецМесяца1 И Рез1М <> Неопределено Тогда
		а0101 = Рез1М.КоличествоРаботников; 
		а0201 = Рез1М.ОтработанныеДни; 
		а0301 = Рез1М.РабочиеДниЗаМесяц; 
		а0401 = Рез1М.НормативЕСП; 
		а0501 = Рез1М.БазовыйРазмерЕСП; 
		а0601 = Рез1М.ЕСПНачислено; 
		а0701 = Рез1М.ЕСПкДоначислению; 
	КонецЕсли;
	Если КонецПериода >= КонецМесяца2 И Рез2М <> Неопределено Тогда
		а0102 = Рез2М.КоличествоРаботников; 
		а0202 = Рез2М.ОтработанныеДни; 
		а0302 = Рез2М.РабочиеДниЗаМесяц; 
		а0402 = Рез2М.НормативЕСП; 
		а0502 = Рез2М.БазовыйРазмерЕСП; 
		а0602 = Рез2М.ЕСПНачислено; 
		а0702 = Рез2М.ЕСПкДоначислению; 
	КонецЕсли;
	Если КонецПериода >= КонецМесяца3 И Рез3М <> Неопределено Тогда
		а0103 = Рез3М.КоличествоРаботников; 
		а0203 = Рез3М.ОтработанныеДни; 
		а0303 = Рез3М.РабочиеДниЗаМесяц; 
		а0403 = Рез3М.НормативЕСП; 
		а0503 = Рез3М.БазовыйРазмерЕСП;     
		а0603 = Рез3М.ЕСПНачислено; 
		а0703 = Рез3М.ЕСПкДоначислению; 
	КонецЕсли;
	а050  = а0501 + а0502 + а0503;     
	а070  = а0701 + а0702 + а0703;
	а090  = а070  + а080;
	а0901 = ?(КонецПериода >= КонецМесяца1, а0701 + а080, 0);
	а0902 = ?(КонецПериода >= КонецМесяца2, а0702 + а0901, 0);
	а0903 = ?(КонецПериода >= КонецМесяца3, а0703 + а0902, 0);
	
	Строки = Новый Структура;
	Строки.Вставить("а010", а010);
	Строки.Вставить("а0101", а0101);
	Строки.Вставить("а0102", а0102);
	Строки.Вставить("а0103", а0103);
	Строки.Вставить("а020", а020);
	Строки.Вставить("а0201", а0201);
	Строки.Вставить("а0202", а0202);
	Строки.Вставить("а0203", а0203);
	Строки.Вставить("а030", а030);
	Строки.Вставить("а0301", а0301);
	Строки.Вставить("а0302", а0302);
	Строки.Вставить("а0303", а0303);
	Строки.Вставить("а040", а040);
	Строки.Вставить("а0401", а0401);
	Строки.Вставить("а0402", а0402);
	Строки.Вставить("а0403", а0403);
	Строки.Вставить("а050", а050);
	Строки.Вставить("а0501", а0501);
	Строки.Вставить("а0502", а0502);
	Строки.Вставить("а0503", а0503);
	Строки.Вставить("а060", а060);
	Строки.Вставить("а0601", а0601);
	Строки.Вставить("а0602", а0602);
	Строки.Вставить("а0603", а0603);
	Строки.Вставить("а070", а070);
	Строки.Вставить("а0701", а0701);
	Строки.Вставить("а0702", а0702);
	Строки.Вставить("а0703", а0703);
	Строки.Вставить("а080", а080);
	Строки.Вставить("а090", а090);
	Строки.Вставить("а0901", а0901);
	Строки.Вставить("а0902", а0902);
	Строки.Вставить("а0903", а0903);
	
	Если ПолучитьСтроку Тогда
		Возврат Строки[Стр];	
	Иначе
		Возврат Строки;
	КонецЕсли;         	
	
КонецФункции // Приложение2_Получить()

Функция Приложение3_Получить(ПолучитьСтроку = Ложь, Стр = "", НачПериода, КонПериода) Экспорт
	
	н010  = 0;	н020  = 0;	н030  = 0;
	н0201 = 0;	н0202 = 0;	н0203 = 0;
	н0204 = 0;	н0205 = 0;	н0206 = 0;
	н0207 = 0;	н0208 = 0;	н0209 = 0;
	
	СписокНеоблагаемыхНачислений = Новый ТаблицаЗначений; 
	СписокНеоблагаемыхНачислений.Колонки.Добавить("Начисление");
	СписокНеоблагаемыхНачислений.Колонки.Добавить("Сумма");
	НалоговаяОтчетность.РассчитатьФОТзаПериод_ЕСП(Организация, НачПериода, КонПериода, , , СписокНеоблагаемыхНачислений);
	
	Для каждого Строка Из СписокНеоблагаемыхНачислений Цикл
		
		Вид = Строка.Начисление.ВидНачисленийНеоблагаемыхЕСП;
		Если (Строка.Начисление.НеоблагаетсяЕСП) И (Вид = Перечисления.ВидыНачисленийНеоблагаемыхЕСП.н030) Тогда
			н030 = н030 + Строка.Сумма;
		ИначеЕсли Вид = Перечисления.ВидыНачисленийНеоблагаемыхЕСП.н0201 Тогда
			н0201 = н0201 + Строка.Сумма;
		ИначеЕсли Вид = Перечисления.ВидыНачисленийНеоблагаемыхЕСП.н0202 Тогда
			н0202 = н0202 + Строка.Сумма;
		ИначеЕсли Вид = Перечисления.ВидыНачисленийНеоблагаемыхЕСП.н0203 Тогда
			н0203 = н0203 + Строка.Сумма;
		ИначеЕсли Вид = Перечисления.ВидыНачисленийНеоблагаемыхЕСП.н0204 Тогда
			н0204 = н0204 + Строка.Сумма;
		ИначеЕсли Вид = Перечисления.ВидыНачисленийНеоблагаемыхЕСП.н0205 Тогда
			н0205 = н0205 + Строка.Сумма;
		ИначеЕсли Вид = Перечисления.ВидыНачисленийНеоблагаемыхЕСП.н0206 Тогда
			н0206 = н0206 + Строка.Сумма;
		ИначеЕсли Вид = Перечисления.ВидыНачисленийНеоблагаемыхЕСП.н0207 Тогда
			н0207 = н0207 + Строка.Сумма;
		ИначеЕсли Вид = Перечисления.ВидыНачисленийНеоблагаемыхЕСП.н0208 Тогда
			н0208 = н0208 + Строка.Сумма;
		ИначеЕсли Вид = Перечисления.ВидыНачисленийНеоблагаемыхЕСП.н0209 Тогда
			н0209 = н0209 + Строка.Сумма;
		КонецЕсли;
		
	КонецЦикла;
	
	н020 = н0201 + н0202 + н0203 + н0204 + н0205 + н0206 + н0207 + н0208 + н0209;
	н010 = н020 + н030;
	
	Строки = Новый Структура;
	Строки.Вставить("н010" , н010);
	Строки.Вставить("н020" , н020);
	Строки.Вставить("н0201", н0201);
	Строки.Вставить("н0202", н0202);
	Строки.Вставить("н0203", н0203);
	Строки.Вставить("н0204", н0204);
	Строки.Вставить("н0205", н0205);
	Строки.Вставить("н0206", н0206);
	Строки.Вставить("н0207", н0207);
	Строки.Вставить("н0208", н0208);
	Строки.Вставить("н0209", н0209);
	Строки.Вставить("н030" , н030);
	
	Если ПолучитьСтроку Тогда
		Возврат Строки[Стр];	
	Иначе
		Возврат Строки;
	КонецЕсли;         	
	
КонецФункции // Приложение3_Получить()

Функция Приложение4_Получить(ПолучитьСтроку = Ложь, Стр = "", НачПериода, КонПериода) Экспорт
	
	н010  = 0;	н020  = 0;	н030  = 0;
	н0201 = 0;	н0202 = 0;	н0203 = 0;
	н0204 = 0;	н0205 = 0;	н0206 = 0;
	н0207 = 0;	н0208 = 0;	н0209 = 0;
	н0210 = 0;
	
	СписокНеоблагаемыхНачислений = Новый ТаблицаЗначений; 
	СписокНеоблагаемыхНачислений.Колонки.Добавить("Начисление");
	СписокНеоблагаемыхНачислений.Колонки.Добавить("Сумма");
	НалоговаяОтчетность.РассчитатьФОТзаПериод_ПФ(Организация, НачПериода, КонПериода, , , СписокНеоблагаемыхНачислений);
	
	Для каждого Строка Из СписокНеоблагаемыхНачислений Цикл
		
		Вид = Строка.Начисление.ВидыНачисленийНеоблагаемыхВзносамиВПФ;
		Если (Строка.Начисление.НеоблагаетсяПФ) И (Вид = Перечисления.ВидыНачисленийНеоблагаемыхВзносамиВПФ.н030) Тогда
			н030 = н030 + Строка.Сумма;
		ИначеЕсли Вид = Перечисления.ВидыНачисленийНеоблагаемыхВзносамиВПФ.н0201 Тогда
			н0201 = н0201 + Строка.Сумма;
		ИначеЕсли Вид = Перечисления.ВидыНачисленийНеоблагаемыхВзносамиВПФ.н0202 Тогда
			н0202 = н0202 + Строка.Сумма;
		ИначеЕсли Вид = Перечисления.ВидыНачисленийНеоблагаемыхВзносамиВПФ.н0203 Тогда
			н0203 = н0203 + Строка.Сумма;
		ИначеЕсли Вид = Перечисления.ВидыНачисленийНеоблагаемыхВзносамиВПФ.н0204 Тогда
			н0204 = н0204 + Строка.Сумма;
		ИначеЕсли Вид = Перечисления.ВидыНачисленийНеоблагаемыхВзносамиВПФ.н0205 Тогда
			н0205 = н0205 + Строка.Сумма;
		ИначеЕсли Вид = Перечисления.ВидыНачисленийНеоблагаемыхВзносамиВПФ.н0206 Тогда
			н0206 = н0206 + Строка.Сумма;
		ИначеЕсли Вид = Перечисления.ВидыНачисленийНеоблагаемыхВзносамиВПФ.н0207 Тогда
			н0207 = н0207 + Строка.Сумма;
		ИначеЕсли Вид = Перечисления.ВидыНачисленийНеоблагаемыхВзносамиВПФ.н0208 Тогда
			н0208 = н0208 + Строка.Сумма;
		ИначеЕсли Вид = Перечисления.ВидыНачисленийНеоблагаемыхВзносамиВПФ.н0209 Тогда
			н0209 = н0209 + Строка.Сумма;
		ИначеЕсли Вид = Перечисления.ВидыНачисленийНеоблагаемыхВзносамиВПФ.н0210 Тогда
			н0210 = н0210 + Строка.Сумма;
		КонецЕсли;
		
	КонецЦикла;
	
	н020 = н0201 + н0202 + н0203 + н0204 + н0205 + н0206 + н0207 + н0208 + н0209 + н0210;
	н010 = н020 + н030;
	
	Строки = Новый Структура;
	Строки.Вставить("н010" , н010);
	Строки.Вставить("н020" , н020);
	Строки.Вставить("н0201", н0201);
	Строки.Вставить("н0202", н0202);
	Строки.Вставить("н0203", н0203);
	Строки.Вставить("н0204", н0204);
	Строки.Вставить("н0205", н0205);
	Строки.Вставить("н0206", н0206);
	Строки.Вставить("н0207", н0207);
	Строки.Вставить("н0208", н0208);
	Строки.Вставить("н0209", н0209);
	Строки.Вставить("н0210", н0210);
	Строки.Вставить("н030" , н030);
	
	Если ПолучитьСтроку Тогда
		Возврат Строки[Стр];	
	Иначе
		Возврат Строки;
	КонецЕсли;         	
	
КонецФункции // Приложение4_Получить()
